////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задание 3                                                                                                      //
// Задайте массив типа int. Пусть его размер задается через директиву препроцессора #define. Инициализируйте его  //
// через ввод с клавиатуры. Напишите для него свою функцию сортировки (например Пузырьком).Реализуйте перестановку//
// элементов как макрокоманду SwapINT(a, b). Вызывайте ее из цикла сортировки                                     //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>

#define L_ARR 7
#define SwapINT(a, b) {int temp = a; a = b; b = temp;}



int main()
{
    setlocale(LC_ALL, "Russian");

    int arr[L_ARR];

    // Инициализация массива через ввод с клавиатуры
    for (size_t i = 0; i < L_ARR; i++) {
        std::cout << "Укажите целочисленное значение элемента #" << i + 1 << ": ";
        std::cin >> arr[i];
        std::cout << std::endl;
    }

    // Сортировка массива пузырьком
    int temp; // временная переменная для обмена элементов местами
    for (int i = 0; i < L_ARR - 1; i++) {
        for (int j = 0; j < L_ARR - i - 1; j++) {
            if (arr[j] > arr[j + 1]) {
                // меняем элементы местами
                SwapINT(arr[j], arr[j + 1]);
                // temp = arr[j];
                // arr[j] = arr[j + 1];
                // arr[j + 1] = temp;
            }
        }
    }

    // Выводим отсортированный массив
    std::cout << "\nОтсортированный массив:\n";
    for (int i = 0; i < L_ARR; i++) {
        std::cout << arr[i] << " ";
    }
    std::cout << std::endl;    
}