////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задание 2                                                                                                      //
// Описать макрокоманду (через директиву define), проверяющую, входит ли переданное ей число (введенное с         //
// клавиатуры) в диапазон от нуля (включительно) до переданного ей второго аргумента (исключительно) и возвращает //
// true или false, вывести на экран «true» или «false»                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>

#define CONTROL_INPUT(x, max) (((x >= 0) && (x < max)) ? 1 : 0)

const int MAX_NUMBER = 100;

int main()
{
    setlocale(LC_ALL, "Russian");

    int x;
    std::cout << "Введите целое число: ";
    std::cin >> x;
    bool result = CONTROL_INPUT(x, MAX_NUMBER);
    std::cout << std::boolalpha << result;
}