////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Написать программу, выводящую на экран “истину”, если две целочисленные константы, объявленные в её начале     // 
// либо равны десяти сами по себе, либо их сумма равна десяти.                                                    //
//                                                                                                                //
// Не совсем понял сам вопрос. Я его расценил как либо любая константа равна 10, либо их сумма равна 10.          //
// Хотя можно расценить и как либо обе константы равны 10, либо их сумма равна 10, тогда условие будет немного    //
// другое, а именно if (i == 10 && j == 10 || i + j == 10)                                                        //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian");
    system("chcp 1251");

    const int i = 10;
    const int j = 10;
    std::cout << "Первая константа = " << i << std::endl;
    std::cout << "Вторая константа = " << j << std::endl;

    if (i == 10 || j == 10 || i + j == 10)
        std::cout << "Истина\n";
    return 0;
}